In [28]:
%ls data

 C 드라이브의 볼륨: OS
 볼륨 일련 번호: D8D2-976C

 C:\Users\joyh1\Desktop\DSC\Inflearn강의자료\데이터분석\data 디렉터리

2020-03-08  오후 02:48    <DIR>          .
2020-03-08  오후 02:48    <DIR>          ..
2020-03-08  오후 02:47       264,920,940 상가업소정보_201912_01.csv
2020-03-08  오후 02:47             2,163 전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv
2020-03-08  오후 02:47           162,510 주택도시보증공사_전국 평균 분양가격(2019년 12월).csv
               3개 파일         265,085,613 바이트
               2개 디렉터리  133,250,338,816 바이트 남음

In [29]:
import pandas as pd

In [30]:
df_last = pd.read_csv("data/주택도시보증공사_전국 평균 분양가격(2019년 12월).csv", encoding="cp949")
df_last.shape

(4335, 5)

In [31]:
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [32]:
df_last.tail()

     지역명               규모구분    연도   월 분양가격(㎡)
4330  제주                 전체  2019  12    3882
4331  제주         전용면적 60㎡이하  2019  12     NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN
4334  제주        전용면적 102㎡초과  2019  12    3601

In [33]:
df_first = pd.read_csv("data/전국 평균 분양가격(2013년 9월부터 2015년 8월까지).csv", encoding="cp949")
df_first.shape

(17, 22)

In [34]:
df_first.head()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [35]:
df_first.tail()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

In [36]:
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB

In [37]:
df_last.isnull()

        지역명   규모구분     연도      월  분양가격(㎡)
0     False  False  False  False    False
1     False  False  False  False    False
2     False  False  False  False    False
3     False  False  False  False    False
4     False  False  False  False    False
...     ...    ...    ...    ...      ...
4330  False  False  False  False    False
4331  False  False  False  False     True
4332  False  False  False  False    False
4333  False  False  False  False     True
4334  False  False  False  False    False

[4335 rows x 5 columns]

In [38]:
df_last.isnull().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [39]:
df_last.isna()

        지역명   규모구분     연도      월  분양가격(㎡)
0     False  False  False  False    False
1     False  False  False  False    False
2     False  False  False  False    False
3     False  False  False  False    False
4     False  False  False  False    False
...     ...    ...    ...    ...      ...
4330  False  False  False  False    False
4331  False  False  False  False     True
4332  False  False  False  False    False
4333  False  False  False  False     True
4334  False  False  False  False    False

[4335 rows x 5 columns]

In [40]:
df_last.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [41]:
df_last["분양가격"] = pd.to_numeric(df_last["분양가격(㎡)"], errors="coerce")

# error option에는 raise, coerce, ignore이 있는데 coerce, ignore은 빈 공백이 있어도 강제로 변환

In [42]:
df_last["평당분양가격"] = df_last["분양가격"] * 3.3  # 3.3은 평당

In [43]:
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0  서울                 전체  2015  10    5841  5841.0  19275.3
1  서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3
4  서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7

In [44]:
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
 5   분양가격     3957 non-null   float64
 6   평당분양가격   3957 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 237.2+ KB

In [45]:
df_last["분양가격(㎡)"].describe()   

# count = 데이터 갯수
# unique = unique한 데이터가 몇개 있는지
# top = 가장 많이 빈번한 데이터는 2221이라는 값의 데이터
# freq = top데이터가 얼마나 자주 나타나는지

count     4058
unique    1753
top       2221
freq        17
Name: 분양가격(㎡), dtype: object

In [46]:
df_last.head()

  지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0  서울                 전체  2015  10    5841  5841.0  19275.3
1  서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3
4  서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7

In [54]:
df_last["전용면적"] = df_last["규모구분"].str.replace("전용면적","")
df_last["전용면적"] = df_last["전용면적"].str.replace("초과","~")
df_last["전용면적"] = df_last["전용면적"].str.replace("이하","")
df_last["전용면적"] = df_last["전용면적"].str.replace(" ","").str.strip()
df_last["전용면적"]

0             전체
1            60㎡
2        60㎡~85㎡
3       85㎡~102㎡
4          102㎡~
          ...
4330          전체
4331         60㎡
4332     60㎡~85㎡
4333    85㎡~102㎡
4334       102㎡~
Name: 전용면적, Length: 4335, dtype: object

In [56]:
df_last.head(5)

  지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격      전용면적
0  서울                 전체  2015  10    5841  5841.0  19275.3        전체
1  서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6       60㎡
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6   60㎡~85㎡
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3  85㎡~102㎡
4  서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7     102㎡~

In [57]:
df_last = df_last.drop(['규모구분', '분양가격(㎡)'], axis=1)
df_last.head()

  지역명    연도   월    분양가격   평당분양가격      전용면적
0  서울  2015  10  5841.0  19275.3        전체
1  서울  2015  10  5652.0  18651.6       60㎡
2  서울  2015  10  5882.0  19410.6   60㎡~85㎡
3  서울  2015  10  5721.0  18879.3  85㎡~102㎡
4  서울  2015  10  5879.0  19400.7     102㎡~

In [58]:
df_last.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지역명     4335 non-null   object
 1   연도      4335 non-null   int64
 2   월       4335 non-null   int64
 3   분양가격    3957 non-null   float64
 4   평당분양가격  3957 non-null   float64
 5   전용면적    4335 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 203.3+ KB

In [59]:
df_last.head(2)

  지역명    연도   월    분양가격   평당분양가격 전용면적
0  서울  2015  10  5841.0  19275.3   전체
1  서울  2015  10  5652.0  18651.6  60㎡

In [65]:
df_last.groupby(['지역명', '연도'])['평당분양가격'].mean().unstack().round()

연도      2015     2016     2017     2018     2019
지역명
강원    7188.0   7163.0   7274.0   8219.0   8934.0
경기   11061.0  11685.0  12305.0  14258.0  15666.0
경남    8459.0   8497.0   8787.0   9328.0  10698.0
경북    7464.0   7753.0   8281.0   8681.0   9050.0
광주    7917.0   9191.0   9614.0   9527.0  12112.0
대구    9019.0  10282.0  12207.0  12139.0  14082.0
대전    8191.0   8911.0   9957.0  10234.0  12619.0
부산   10377.0  10744.0  11561.0  12890.0  13538.0
서울   20316.0  21753.0  21831.0  23202.0  28287.0
세종    8765.0   8858.0   9133.0  10340.0  11299.0
울산    9368.0   9583.0  10667.0  10241.0  10216.0
인천   10976.0  11099.0  11641.0  11882.0  13250.0
전남    6799.0   6937.0   7373.0   7930.0   8219.0
전북    7110.0   6907.0   7399.0   8175.0   8532.0
제주    7951.0   9567.0  12567.0  11936.0  11828.0
충남    7690.0   7958.0   8198.0   8202.0   8749.0
충북    6829.0   7133.0   7473.0   8149.0   7971.0

In [66]:
df_last.head(2)

  지역명    연도   월    분양가격   평당분양가격 전용면적
0  서울  2015  10  5841.0  19275.3   전체
1  서울  2015  10  5652.0  18651.6  60㎡

In [77]:
df_last.groupby(['지역명', '연도'])['평당분양가격'].max().unstack().round().T
group = df_last.groupby(['지역명','연도'])['평당분양가격'].min()
group.unstack().transpose()

지역명,강원,경기,경남,경북,광주,대구,대전,부산,서울,세종,울산,인천,전남,전북,제주,충남,충북
연도,,,,,,,,,,,,,,,,,
2015,6801.3,10160.7,7260.0,7078.5,7428.3,8259.9,8012.4,9735.0,18651.6,8487.6,7992.6,10292.7,6289.8,6352.5,7342.5,6926.7,6164.4
2016,6656.1,10553.4,7491.0,6949.8,7903.5,8355.6,8002.5,9669.0,19918.8,8530.5,8438.1,9801.0,6289.8,6270.0,7458.0,6976.2,6319.5
2017,6639.6,11088.0,7837.5,7543.8,8078.4,9962.7,8580.0,9942.9,19364.4,8820.9,9111.3,10335.6,6791.4,6557.1,9995.7,7329.3,6520.8
2018,7312.8,12516.9,8679.0,7989.3,8094.9,9787.8,8243.4,12058.2,16701.3,9867.0,9537.0,9537.0,7101.6,7203.9,9741.6,7533.9,6850.8
2019,7626.3,13810.5,9009.0,8157.6,10583.1,13054.8,10979.1,12246.3,22578.6,9867.0,8962.8,11269.5,7101.6,7748.4,9741.6,7695.6,7009.2

In [85]:
# pivot_table의 aggfunc 기본값은 mean 이다!
a = pd.pivot_table(df_last, index='지역명', columns='연도', values='평당분양가격', aggfunc="max")
b = pd.pivot_table(df_last, index=['연도','지역명'], values='평당분양가격', aggfunc='mean')
c = pd.pivot_table(df_last, index=['지역명','연도'], values='평당분양가격', aggfunc='mean')
c

               평당분양가격
지역명 연도
강원  2015  7188.060000
    2016  7162.903846
    2017  7273.560000
    2018  8219.255000
    2019  8934.475000
...               ...
충북  2015  6828.800000
    2016  7133.335000
    2017  7473.120000
    2018  8149.295000
    2019  7970.875000

[85 rows x 1 columns]